# Data Cleaning and Preparation

## 1. Handling Missing Data
- None도 Missing Data 처리함
- pd.isnull() / pd.notnull()

In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None

In [6]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data
- pd.dropna(axis=0) : NA값이 있는 행을 자름 how='all' 옵션은 행 데이터가 모두 NaN일 때 자름 thresh=n은 축에 최소 n개의 NaN값이 있을 때 그 행을 자름

In [7]:
from numpy import nan as NA

In [8]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [9]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
 ....: [NA, NA, NA], [NA, 6.5, 3.]])

In [12]:
cleaned = data.dropna()

In [13]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [15]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [16]:
df = pd.DataFrame(np.random.randn(7,3))

In [17]:
df.iloc[:4, 1] = NA;
df.iloc[:2, 2] = NA;

In [18]:
df

          0         1         2
0 -0.118145       NaN       NaN
1  1.547073       NaN       NaN
2 -0.213105       NaN -1.922808
3  2.627147       NaN  0.058721
4  0.543944  0.716067 -0.121371
5 -0.007847  0.830056 -0.381499
6  1.437128  1.438906 -0.137282

In [19]:
df.dropna(thresh=2)

          0         1         2
2 -0.213105       NaN -1.922808
3  2.627147       NaN  0.058721
4  0.543944  0.716067 -0.121371
5 -0.007847  0.830056 -0.381499
6  1.437128  1.438906 -0.137282

### Filling In Missing Data
- pd.fillna(데이터/딕셔너리도 가능) : NaN값이 다른 값으로 채워진 객체 새로 return
객체를 새로 만들지 않고 원 데이터 자체를 변경하려면 inplace=True 옵션 이용
- method='ffill' / 'bfill' : NaN값을 어떤 값으로 채우는가? 바로 직전의 값/뒤의 값
limit=n : 그 뒤로 몇개를 채울 것인지도 지정가능

In [20]:
df.fillna(0)

          0         1         2
0 -0.118145  0.000000  0.000000
1  1.547073  0.000000  0.000000
2 -0.213105  0.000000 -1.922808
3  2.627147  0.000000  0.058721
4  0.543944  0.716067 -0.121371
5 -0.007847  0.830056 -0.381499
6  1.437128  1.438906 -0.137282

In [21]:
df.fillna({1:0.5, 2:0})

          0         1         2
0 -0.118145  0.500000  0.000000
1  1.547073  0.500000  0.000000
2 -0.213105  0.500000 -1.922808
3  2.627147  0.500000  0.058721
4  0.543944  0.716067 -0.121371
5 -0.007847  0.830056 -0.381499
6  1.437128  1.438906 -0.137282

In [22]:
df.fillna(0, inplace=True)

In [23]:
df

          0         1         2
0 -0.118145  0.000000  0.000000
1  1.547073  0.000000  0.000000
2 -0.213105  0.000000 -1.922808
3  2.627147  0.000000  0.058721
4  0.543944  0.716067 -0.121371
5 -0.007847  0.830056 -0.381499
6  1.437128  1.438906 -0.137282

In [24]:
df = pd.DataFrame(np.random.randn(6,3))

In [25]:
df.iloc[2:, 1] = NA;
df.iloc[4:, 2] = NA;

In [26]:
df

          0         1         2
0  0.138905 -1.453469  1.058599
1  0.574033 -0.011939  0.533875
2  0.103943       NaN  1.158859
3 -0.681333       NaN -0.146235
4  0.787553       NaN       NaN
5  0.180145       NaN       NaN

In [27]:
df.fillna(method='ffill')

          0         1         2
0  0.138905 -1.453469  1.058599
1  0.574033 -0.011939  0.533875
2  0.103943 -0.011939  1.158859
3 -0.681333 -0.011939 -0.146235
4  0.787553 -0.011939 -0.146235
5  0.180145 -0.011939 -0.146235

In [28]:
df.fillna(method='ffill', limit = 2)

          0         1         2
0  0.138905 -1.453469  1.058599
1  0.574033 -0.011939  0.533875
2  0.103943 -0.011939  1.158859
3 -0.681333 -0.011939 -0.146235
4  0.787553       NaN -0.146235
5  0.180145       NaN -0.146235

## 2. Data Transformation

### Removing Duplicates
- pd.duplicated() : 행과 열, 데이터가 모두 같은 중복값이 있는지를 요소마다 반환
- pd.drop_duplicates() : 중복 데이터 없앤 dataframe 반환
- 옵션// drop_duplicates(기준) 을 하면 기준에서만 중복값이 있는지 판단하여 기능함
        keep='last' : 중복값을 없앨 때 맨 마지막 데이터만 남김

In [29]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
 ....: 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [30]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [31]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [32]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [33]:
data['v1'] = range(7)

In [34]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

### Transforming Data Using a Function or Mapping
- 소문자로 바꾸기:pd.str.lower()
- apply : dataframe 축 전체 / applymap : dataframe 요소마다 / map : series

In [35]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
 ....: 'Pastrami', 'corned beef', 'Bacon',
 ....: 'pastrami', 'honey ham', 'nova lox'],
 ....: 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [36]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [37]:
meat_to_animal = {
 'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'
}

In [38]:
lowercased = data['food'].str.lower()

In [39]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [40]:
data['animal'] = lowercased.map(meat_to_animal)

In [41]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [42]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values
- pd.replace()

In [43]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [44]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [45]:
data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes
- pd.rename

In [46]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
 ....: index=['Ohio', 'Colorado', 'New York'],
 ....: columns=['one', 'two', 'three', 'four'])

In [47]:
data.index

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

In [48]:
transform = lambda x:x[:4].upper()

In [49]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [50]:
data.index = data.index.map(transform)

In [51]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [52]:
data.rename(index={'OHIO': 'INDIANA'},
 ....: columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

### Discretization Binningb
- pd.cut(데이터, 짜를 범위 데이터, right=True, labels=그룹이름)
- pd.qcut // 분위로 자름
- categories : 범주

In [53]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [54]:
bins = [18, 25, 35, 60, 100]

In [55]:
cats = pd.cut(ages, bins)

In [56]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [57]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [58]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [59]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [60]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [61]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [62]:
data = np.random.randn(1000)

In [63]:
cats = pd.qcut(data, 4)

In [64]:
cats

[(0.657, 3.106], (-2.988, -0.646], (-2.988, -0.646], (-0.646, -0.0554], (-0.0554, 0.657], ..., (0.657, 3.106], (-0.0554, 0.657], (0.657, 3.106], (-0.0554, 0.657], (0.657, 3.106]]
Length: 1000
Categories (4, interval[float64]): [(-2.988, -0.646] < (-0.646, -0.0554] < (-0.0554, 0.657] < (0.657, 3.106]]

In [65]:
pd.value_counts(cats)

(0.657, 3.106]       250
(-0.0554, 0.657]     250
(-0.646, -0.0554]    250
(-2.988, -0.646]     250
dtype: int64

### Detecting and Filtering Outliers
- pd.describe()

In [66]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [67]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.008511    -0.068302    -0.029610    -0.015472
std       0.963778     0.974910     1.041659     0.992407
min      -2.830412    -3.203638    -3.454429    -3.764513
25%      -0.652671    -0.716174    -0.684461    -0.642930
50%       0.020947    -0.054034    -0.068036    -0.020335
75%       0.625264     0.549249     0.691278     0.661177
max       2.766045     3.181671     3.127533     3.167790

In [68]:
data[np.abs(data)>3] = np.sign(data) * 3
##numpy.sign : 음수/양수여부 반환 음수이면 -1, 0이면 0, 양수이면 1 반환

In [69]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.008511    -0.068368    -0.028737    -0.014687
std       0.963778     0.973404     1.038242     0.988700
min      -2.830412    -3.000000    -3.000000    -3.000000
25%      -0.652671    -0.716174    -0.684461    -0.642930
50%       0.020947    -0.054034    -0.068036    -0.020335
75%       0.625264     0.549249     0.691278     0.661177
max       2.766045     3.000000     3.000000     3.000000

### Permutation and Random Sampling
- np.random.permutation(n) : n부터 1까지의 순열 sample
- pd.sample(n) : 원 데이터중 n개의 sample data 추출

In [70]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [71]:
sampler = np.random.permutation(5)

In [72]:
sampler

array([0, 4, 3, 2, 1])

In [73]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [74]:
df.take(sampler) #take(인덱스) : 주어진 인덱스 순서대로 자리 바꾸기!

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7

In [75]:
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
0   0   1   2   3
4  16  17  18  19

In [76]:
choices = pd.Series([5, 7, -1, 6, 4])

In [77]:
draws = choices.sample(n=10, replace=True)

In [78]:
draws

2   -1
1    7
1    7
0    5
0    5
1    7
3    6
2   -1
2   -1
0    5
dtype: int64

### Computing Indicator/Dummy Variables
- pd.get_dummies : 행/열마다  데이터 개수세주기!

In [79]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
 .....: 'data1': range(6)})

In [80]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [81]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [82]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [83]:
mnames = ['movie_id', 'title', 'genres']

In [84]:
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
 .....: header=None, names=mnames)

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

In [85]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [86]:
all_genres = []

In [87]:
for x in movies.genres:
    all_genres.extend(x.split('|'))
#extend : iterable 객체에 데이터를 합쳐서 새로운 iterable 객체 반환

In [88]:
genres = pd.unique(all_genres)

In [89]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [90]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [91]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [92]:
gen = movies.genres[0]

In [93]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [94]:
dummies.columns.get_indexer(gen.split('|'))
#get_indexer(data) : 데이터에서 주어진 값을 찾아 그 인덱스를 return함

array([0, 1, 2], dtype=int64)

In [95]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [96]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
#add_prefix : 접두어 정의

In [97]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

## String Manipulation

### String Object Methods
- split(',') : 쪼개기
- strip()/lstrip()/rstrip() : 공백제거
- find(',') : 단어에 ','가 있으면 1, 없으면 -1 반환
- index(',') : 맨 처음에 ','가 등장하느 인덱스 반환. 없으면 오류 뜸

In [99]:
val = 'a,b, guido'

In [101]:
val.split(',')

['a', 'b', ' guido']

In [102]:
pieces = [x.strip() for x in val.split(',')]

In [103]:
pieces

['a', 'b', 'guido']

In [104]:
first, second, third = pieces

In [106]:
first + '::' + second + '::' + third #리스트를 쪼개기 가능!

'a::b::guido'

In [107]:
'::'.join(pieces)

'a::b::guido'

In [108]:
val.index(',')

1

In [109]:
val.find(':')

-1

In [110]:
val.find(',')

1

### Regular Expressions
- import re
- re.split('표현식', 표현식을 적용할 문장) = re.compile('표현식').split(적용할 문장)
- re.compile('표현식').findall(적용할 문장) : 적용할 문장에서 표현식과 매칭되는 요소를 찾음
- re.compile.search(적용할 문장) : 처음부터 찾아서 매칭되는 제일 첫번째 단어 및 문장 반환

In [111]:
import re

In [112]:
text = "foo bar\t baz \tqux"

In [113]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [114]:
regex = re.compile('\s+')

In [115]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [116]:
regex.findall(text)

[' ', '\t ', ' \t']

In [137]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [138]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [139]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [140]:
m = regex.search(text)

In [141]:
text[m.start():m.end()]

'dave@google.com'

In [142]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [143]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [144]:
m = regex.match('wesm@bright.net')

In [145]:
m.groups()

('wesm', 'bright', 'net')

In [146]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

### Vectorized String Functions in pandas
- pd.str.contains(' ')
- pd.str.match(pattern, flags=)

In [147]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
 .....: 'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [148]:
data = pd.Series(data)

In [149]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [150]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [151]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [152]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object